{"pageProps":{"htmlString":"<h2>2023</h2>\n<p>I have never really tracked this before. I want to organize this by months eventually but I don&#39;t remember when I actually read these books, only that I did this year. \nIt would be nice too to link to where you can get these books. \nNOTE: I am omitting my personal reviews from this because my thoughts are scribbled in the books and I would prefer to keep them personal.</p>\n<ul>\n<li>Frank Burly Series by John Swartzwelder</li>\n<li>Never Split the Difference by Chris Voss</li>\n<li>The Study Quran - A New Translation and Commentary by Seyyed Hossein Nasr</li>\n<li>Believing Women in Islam by Asma Barias</li>\n<li>First Principles of Islamic Economics by Sayyid Abul A&#39;la Mawdudi</li>\n<li>Asimov&#39;s Guide to the Bible Two Volumes in One, the Old and New testaments by Isaac Asimov</li>\n<li>The Autobiography of Malcom X as Told by Alex Haley-Ballantine by Malcom X</li>\n<li>Islam A Short History by Karen Armstrong</li>\n<li>Women and Gender in Islam: Historical Roots of a Modern Debate by Leila Ahmed</li>\n<li>When They Severed Earth from Sky: How the Human Mind Shapes Myth by Elizabeth Wayland Barber</li>\n<li>Game Design Companion: A Critcal Analysis of Wario Land 4</li>\n<li>Mission to the Volga by Ahmad Ibn Fadlan</li>\n<li>The Case for God by Karen Armstrong</li>\n<li>Come as You are by Emily Nagoski</li>\n<li>The Rape of the Mind: The Psychology of Thought Control, Menticide, and Brainwashing by Joost Abraham Maurits Meerloo</li>\n<li>Crows by Candace Savage</li>\n<li>In the Company of Crows and Ravens by John M. Marzluff</li>\n<li>Deleuze and Guattari&#39;s &#39;A Thousand Plateaus&#39;: A Reader&#39;s Guide (Reader&#39;s Guides)  by Eugene W. Holland (I didn&#39;t finish this one its is heavy and frenchy)</li>\n<li>Mind of the Raven by Bernd Heinrich</li>\n<li>On Becoming A Person by Carl R Rogers</li>\n<li>How Jesus Became God by Bart D. Ehrman</li>\n<li>Understanding Power by Noam Chomsky</li>\n<li>Virtual Light by William Gibson</li>\n<li>Debt, the First 5,000 Years by David Graeber</li>\n<li>How the World Really Works by Vaclav Smil</li>\n<li>Glasshouse by Charles Stross</li>\n<li>Snuff by Terry Pratchett</li>\n<li>Pet Sematary by Steven King</li>\n<li>The Sexual Contract by Carole Pateman</li>\n</ul>\n","data":{"title":"Books I Have Read","description":"On going list of books I have read, organized by year.","slug":"Books-I-Have-Read","created":"2023-10-16T12:21","updated":"2023-10-16T17:04"}},"__N_SSG":true}